app/controllers/clients_controller.rb

  def index
    @clients = Client.all(:include => :branches)
---
SELECT "branches".*, t0.client_id as the_parent_record_id FROM "branches" INNER JOIN "branches_clients" t0 ON "branches".id = t0.branch_id WHERE (t0.client_id IN (1,2,3,4,5))
SELECT * FROM "clients" ORDER BY name ASC

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 6) ORDER BY name ASC

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def create
    # map branch ids to branch objects
    if params[:client] and params[:client][:branches]
      params[:client][:branches] = params[:client][:branches].inject([]) {|memo,b| memo << Branch.find(b) }.flatten!
---
INSERT INTO "clients" ("name", "created_at", "sample_code", "updated_at", "API", "sample_urls") VALUES('test', '2010-03-11 04:48:37', '', '2010-03-11 04:48:37', 'APDSF', '')
SELECT * FROM "branches" WHERE ("branches"."id" = 1)

  def update
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def destroy
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT * FROM "clients" WHERE ("clients"."id" = 6) ORDER BY name ASC
DELETE FROM "clients" WHERE "id" = 6

  def save
    @client = Client.find(params[:id])
    @branch = Branch.find(params[:branch])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1) ORDER BY name ASC
SELECT * FROM "branches" WHERE ("branches"."id" = 2)