app/controllers/contacts_controller.rb

  def index
    params[:search] ||= {}
    @search = Contact.search(params[:search])
---
SELECT * FROM "contacts" WHERE (contacts.client_id = 1)

  def show
    @contact = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)

  def edit
    @contact = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "created_at", "updated_at", "role", "client_id", "phone", "email") VALUES('jonathan', '2010-03-11 17:55:02', '2010-03-11 17:55:02', 'president', 1, '', '')

  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 2)
DELETE FROM "contacts" WHERE "id" = 2