app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "role", "password_salt", "persistence_token", "login", "password") VALUES('2010-03-10 22:33:56', '2010-03-10 22:33:56', 'admin', NULL, NULL, 'admin', 'test')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
DELETE FROM "users" WHERE "id" = 3