app/controllers/widgets_controller.rb

  def index
    @widgets = Widget.all
---
SELECT * FROM "widgets"

  def show
    @widget = Widget.find(params[:id])
---
SELECT * FROM "widgets" WHERE ("widgets"."id" = 1)

  def create
    @widget = Widget.new(params[:widget])

    respond_to do |format|
      if @widget.save
---
INSERT INTO "widgets" ("created_at", "notes", "updated_at", "branch_id", "version") VALUES('2010-03-11 15:28:35', '', '2010-03-11 15:28:35', 1, '1.1.0')

  def destroy
    @widget = Widget.find(params[:id])
    @widget.destroy
---
SELECT * FROM "widgets" WHERE ("widgets"."id" = 1)
DELETE FROM "widgets" WHERE "id" = 1